API/tests/performance_tests.yml
config: 
    target: ${{secrets.API_URL}}
    phases:
      - duration: 60
        arrivalRate: 1
        name: "Performance under relative low load"
      - duration: 120
        arrivalRate: 1
        rampTo: 50
        name: "Performance under moderate load"
      - duration: 60
        arrivalRate: 50
        name: "Max load"
    defaults:
        headers:
            authorization: ${{secrets.BEARER_TOKEN}}
scenarios:
  - name: "Driver Log in"
    flow: 
     - post:
        url: "/api/drivers/authenticate"
        json:
            email: ${{secrets.EMAIL_TEST_D}}
            password: ${{secrets.PASSWORD_TEST_D}}