API/tests/performance_tests.yml
config: 
    target: "{{ $processEnvironment.SERVICE_API_KEY }}"
    phases:
      - duration: 60
        arrivalRate: 1
        name: "Performance under relative low load"
      - duration: 60
        arrivalRate: 50
        name: "Performance under moderate load"
      - duration: 60
        arrivalRate: 100
        name: "High Load"
    defaults:
        headers:
            authorization: "Bearer {{ $processEnvironment.BEARER_TOKEN }}" 
scenarios:
  - name: "Driver Log in"
    flow: 
     - post:
        url: "/api/drivers/authenticate"
        json:
            email: ${{secrets.EMAIL_TEST_D}}
            password: ${{secrets.PASSWORD_TEST_D}}